physics/climate/models-hierarchy.org
#+TITLE: Hierarchy of Climate Models
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2021-05-22T12:43:27-07:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Saturday May 22, 2021 at 12:43PM

This is an annotated bibliography of the available software for climate
models. It seems that each component has been independently developed by
different groups and agencies.

* Radiative Transfer Models
:PROPERTIES:
:CUSTOM_ID: h-78f8baee-6f4b-4f02-95f7-3ab2697eaffb
:END:

** Atmospheric & Environmental Research (AER) Working Group
:PROPERTIES:
:CUSTOM_ID: h-b411b9fa-b776-4b87-a0f0-58a5ca2b2fb1
:END:

This group seems to have standardized the abbreviations for many models
of radiative transfer.

- [[https://web.archive.org/web/20210413060526/http://www.rtweb.aer.com/][rtweb.aer.com]] (archived)
- [[https://www.aer.com/science-research/atmosphere/radiative-transfer/][aer.com]]

* Atmospheric General Circulation Models
:PROPERTIES:
:CUSTOM_ID: h-bf370b6d-78a9-4e61-a2f8-43149b238ea1
:END:


There's a plethora of models here. I'm following Paul Edwards's
{{{book-title(A Vast Machine: Computer Models, Climate Data, and the Politics of Global Warming)}}}
appendix (also available [[https://pne.people.si.umich.edu/vastmachine/agcm.html][online]]) and the [[https://web.archive.org/web/20040825054939/http://www.aip.org/history/gcm/][AIP's history of GCMs]].

** Primordial Models
:PROPERTIES:
:CUSTOM_ID: h-b472bf21-5aa6-4620-86e6-e0f07ac8360e
:END:

Edwards classified the models in the 1955--1965 period as consisting of
four families of general circulation models:

1. Norman Phillips' model, apparently called the GCRS model (named after
   where he worked: the general circulation research section)
2. the UCLA Models
3. Lawrence Livermore model, referred to as LAM ("Leith Atmospheric Model" or "Livermore Atmospheric Model")
4. National Center for Atmospheric Research (NCAR)

Pre-internet computer-based research had this pattern of: one institute
came up with some program, then proselytized it on the "academic
circuit" (i.e., at conferences, seminars, etc.), sharing the source
code. Then followed a Cambrian explosion of innovation. Rather, rinse,
repeat.

*** General Circulation Research Section [GCRS] (1956)
:PROPERTIES:
:CUSTOM_ID: h-65de0020-de60-4547-8d19-4afd58ebfa11
:END:

Note: I've seen this referred to as the "GCRS" model, but no one really
expands on what that acronym abbreviates. It turns out to abbreviate
"General Circulation Research Section" (which was the forerunner to the
GFDL group).

This was the first published general circulation model. It was a proof
of concept, starting with simplifying assumptions like barotropy and
quasi-geostrophy, then removing them one by one.

- Norman Phillips,\\
  "The general circulation of the atmosphere: a numerical experiment".\\
  /Q. J. of the Roy. Met. Soc./ *82*, 352 (1956) 123--164;
- J.M. Lewis,\\
  "Clarifying the Dynamics of the General Circulation: Phillips's 1956 Experiment".\\
  /Bulletin of the American Meteorological Society/ *79*, no.1 (1998) 39--60. 

*** UCLA Models
:PROPERTIES:
:CUSTOM_ID: h-66c4aeb3-885f-4c50-b41c-29f704a12dbf
:END:

Yale Mintz recruited Akio Arakawa (of Tokyo University) to team up and
make a model. Well, it was a happy family of models, more properly.

#+begin_remark
The numbering scheme for the models seems inconsistent to me. In the
book {{{book-title(A Vast Machine)}}}, Paul Edwards enumerates them from
I, to V; but on his [[https://pne.people.si.umich.edu/vastmachine/i.UCLA.html][website]] he starts at "prototype", then numbers them
I to IV. I'll follow his book's conventions.
#+end_remark

**** Model I (1960?--1965)
:PROPERTIES:
:CUSTOM_ID: h-3cba208b-e58a-4dc8-9443-834c78e2ef38
:END:

The initial model was completed in 1963 then abandoned in 1965.

The first Mintz/Arakawa model was a 2-level global, primitive-equation
GCM at a 7° latitude x 9° longitude horizontal resolution. It included
realistic land-sea distributions and surface topography. Mintz never
learned to program computers; Arakawa carried out all the model coding.
The UCLA prototype model has been credited as inspiring the European
Centre for Medium-Range Weather Forecasts (ECMWF) model.

- Y. Mintz,\\
  "Design of Some Numerical General Circulation Experiments".\\
  /Bulletin of the Research Council of Israel/ *76* (1958) 67--114.
- W.E. Langlois and H.C.W. Kwok,\\
  "Description of the Mintz-Arakawa Numerical General Circulation Model".\\
  (Dept. of Meteorology, University of California at Los Angeles, 1969).
- A. Arakawa,\\
  "Numerical Simulation of Large-Scale Atmospheric Motions".\\
  /Numerical Solution of Field Problems in Continuum Physics/
  (SIAM-AMS Proceedings, American Mathematical Society) *2* (1970) 24--40.

