docs/physics/climate/models-hierarchy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-01 Tue 19:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hierarchy of Climate Models</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Hierarchy of Climate Models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-78f8baee-6f4b-4f02-95f7-3ab2697eaffb">1. Radiative Transfer Models</a>
<ul>
<li><a href="#h-b411b9fa-b776-4b87-a0f0-58a5ca2b2fb1">1.1. Atmospheric &amp; Environmental Research (AER) Working Group</a></li>
</ul>
</li>
<li><a href="#h-bf370b6d-78a9-4e61-a2f8-43149b238ea1">2. Atmospheric General Circulation Models</a>
<ul>
<li><a href="#h-b472bf21-5aa6-4620-86e6-e0f07ac8360e">2.1. Primordial Models</a>
<ul>
<li><a href="#h-65de0020-de60-4547-8d19-4afd58ebfa11">2.1.1. General Circulation Research Section [GCRS] (1956)</a></li>
<li><a href="#h-66c4aeb3-885f-4c50-b41c-29f704a12dbf">2.1.2. UCLA Models</a>
<ul>
<li><a href="#h-3cba208b-e58a-4dc8-9443-834c78e2ef38">2.1.2.1. Model I (1960?&#x2013;1965)</a></li>
<li><a href="#h-02d3e4e2-f2b0-4c57-9a5d-156a4adc293f">2.1.2.2. Model II (1965&#x2013;1972??)</a></li>
<li><a href="#h-51e23b0c-ac21-4ea2-966c-20e65107f585">2.1.2.3. Model III (1972??&#x2013;mid 1970s)</a></li>
<li><a href="#h-2238ffc9-cdc5-49e2-9633-2a8ca2b2cd2a">2.1.2.4. Model IV (late 1970s)</a></li>
<li><a href="#h-c9ea2a8e-de5c-46c9-bc11-af09d963719a">2.1.2.5. Model V (c.1990-????)</a></li>
</ul>
</li>
<li><a href="#h-32736c4d-9f84-4ca5-9d8f-2a9738b2da11">2.1.3. The Livermore Atmospheric Model "LAM" (1960&#x2013;1965)</a></li>
<li><a href="#h-d66b6597-34d0-4658-9ca0-cc2ed6ae6d1b">2.1.4. The National Center for Atmospheric Research (1964&#x2013;????)</a>
<ul>
<li><a href="#h-9714e84d-954b-4f73-b6de-8d4b8768da73">2.1.4.1. NCAR 1 (1964&#x2013;1967?)</a></li>
<li><a href="#h-34006cdd-68e4-4324-95b4-654a1162c2c6">2.1.4.2. NCAR 2 (1967?&#x2013;1970)</a></li>
<li><a href="#h-bbd4824e-994d-4e3d-b72d-55010bfd3908">2.1.4.3. NCAR 3 (1970?&#x2013;1973)</a></li>
<li><a href="#h-a044a191-3e6e-4d38-9a0c-e64668da8917">2.1.4.4. CCM-0A (197?&#x2013;1977?)</a></li>
<li><a href="#h-8d9835ea-f58f-4e38-a823-c726ee917d97">2.1.4.5. CCM-0B (1981&#x2013;198?)</a></li>
<li><a href="#h-4fdb5799-e3c1-4555-892e-466aed11ef1d">2.1.4.6. CCM-1 (1987?&#x2013;????)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-1a943d30-650d-4ad9-819b-620b7af5f6ea">2.2. Australian  Numerical  Meteorological  Research  Centre [ANMRC] (1977)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is an annotated bibliography of the available software for climate
models. It seems that each component has been independently developed by
different groups and agencies.
</p>

<div id="outline-container-h-78f8baee-6f4b-4f02-95f7-3ab2697eaffb" class="outline-2">
<h2 id="h-78f8baee-6f4b-4f02-95f7-3ab2697eaffb"><span class="section-number-2">1</span> Radiative Transfer Models</h2>
<div class="outline-text-2" id="text-h-78f8baee-6f4b-4f02-95f7-3ab2697eaffb">
</div>

<div id="outline-container-h-b411b9fa-b776-4b87-a0f0-58a5ca2b2fb1" class="outline-3">
<h3 id="h-b411b9fa-b776-4b87-a0f0-58a5ca2b2fb1"><span class="section-number-3">1.1</span> Atmospheric &amp; Environmental Research (AER) Working Group</h3>
<div class="outline-text-3" id="text-h-b411b9fa-b776-4b87-a0f0-58a5ca2b2fb1">
<p>
This group seems to have standardized the abbreviations for many models
of radiative transfer.
</p>

<ul class="org-ul">
<li><a href="https://web.archive.org/web/20210413060526/http://www.rtweb.aer.com/">rtweb.aer.com</a> (archived)</li>
<li><a href="https://www.aer.com/science-research/atmosphere/radiative-transfer/">aer.com</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-bf370b6d-78a9-4e61-a2f8-43149b238ea1" class="outline-2">
<h2 id="h-bf370b6d-78a9-4e61-a2f8-43149b238ea1"><span class="section-number-2">2</span> Atmospheric General Circulation Models</h2>
<div class="outline-text-2" id="text-h-bf370b6d-78a9-4e61-a2f8-43149b238ea1">
<p>
There's a plethora of models here. I'm following Paul Edwards's
<cite class="book-title">A Vast Machine: Computer Models</cite>
appendix (also available <a href="https://pne.people.si.umich.edu/vastmachine/agcm.html">online</a>) and the <a href="https://web.archive.org/web/20040825054939/http://www.aip.org/history/gcm/">AIP's history of GCMs</a>.
</p>
</div>

<div id="outline-container-h-b472bf21-5aa6-4620-86e6-e0f07ac8360e" class="outline-3">
<h3 id="h-b472bf21-5aa6-4620-86e6-e0f07ac8360e"><span class="section-number-3">2.1</span> Primordial Models</h3>
<div class="outline-text-3" id="text-h-b472bf21-5aa6-4620-86e6-e0f07ac8360e">
<p>
Edwards classified the models in the 1955&#x2013;1965 period as consisting of
four families of general circulation models:
</p>

<ol class="org-ol">
<li>Norman Phillips' model, apparently called the GCRS model (named after
where he worked: the general circulation research section)</li>
<li>the UCLA Models</li>
<li>Lawrence Livermore model, referred to as LAM ("Leith Atmospheric Model" or "Livermore Atmospheric Model")</li>
<li>National Center for Atmospheric Research (NCAR)</li>
</ol>

<p>
Pre-internet computer-based research had this pattern of: one institute
came up with some program, then proselytized it on the "academic
circuit" (i.e., at conferences, seminars, etc.), sharing the source
code. Then followed a Cambrian explosion of innovation. Rather, rinse,
repeat.
</p>
</div>

<div id="outline-container-h-65de0020-de60-4547-8d19-4afd58ebfa11" class="outline-4">
<h4 id="h-65de0020-de60-4547-8d19-4afd58ebfa11"><span class="section-number-4">2.1.1</span> General Circulation Research Section [GCRS] (1956)</h4>
<div class="outline-text-4" id="text-h-65de0020-de60-4547-8d19-4afd58ebfa11">
<p>
Note: I've seen this referred to as the "GCRS" model, but no one really
expands on what that acronym abbreviates. It turns out to abbreviate
"General Circulation Research Section" (which was the forerunner to the
GFDL group).
</p>

<p>
This was the first published general circulation model. It was a proof
of concept, starting with simplifying assumptions like barotropy and
quasi-geostrophy, then removing them one by one.
</p>

<ul class="org-ul">
<li>Norman Phillips,<br>
"The general circulation of the atmosphere: a numerical experiment".<br>
<i>Q. J. of the Roy. Met. Soc.</i> <b>82</b>, 352 (1956) 123&#x2013;164;</li>
<li>J.M. Lewis,<br>
"Clarifying the Dynamics of the General Circulation: Phillips's 1956 Experiment".<br>
<i>Bulletin of the American Meteorological Society</i> <b>79</b>, no.1 (1998) 39&#x2013;60.</li>
</ul>
</div>
</div>

<div id="outline-container-h-66c4aeb3-885f-4c50-b41c-29f704a12dbf" class="outline-4">
<h4 id="h-66c4aeb3-885f-4c50-b41c-29f704a12dbf"><span class="section-number-4">2.1.2</span> UCLA Models</h4>
<div class="outline-text-4" id="text-h-66c4aeb3-885f-4c50-b41c-29f704a12dbf">
<p>
Yale Mintz recruited Akio Arakawa (of Tokyo University) to team up and
make a model. Well, it was a happy family of models, more properly.
</p>

<div class="remark" id="org4186bc5">
<p>
The numbering scheme for the models seems inconsistent to me. In the
book <cite class="book-title">A Vast Machine</cite>, Paul Edwards enumerates them from
I, to V; but on his <a href="https://pne.people.si.umich.edu/vastmachine/i.UCLA.html">website</a> he starts at "prototype", then numbers them
I to IV. I'll follow his book's conventions.
</p>

</div>
</div>

<div id="outline-container-h-3cba208b-e58a-4dc8-9443-834c78e2ef38" class="outline-5">
<h5 id="h-3cba208b-e58a-4dc8-9443-834c78e2ef38"><span class="section-number-5">2.1.2.1</span> Model I (1960?&#x2013;1965)</h5>
<div class="outline-text-5" id="text-h-3cba208b-e58a-4dc8-9443-834c78e2ef38">
<p>
The initial model was completed in 1963 then abandoned in 1965.
</p>

<p>
The first Mintz/Arakawa model was a 2-level global, primitive-equation
GCM at a 7° latitude x 9° longitude horizontal resolution. It included
realistic land-sea distributions and surface topography. Mintz never
learned to program computers; Arakawa carried out all the model coding.
The UCLA prototype model has been credited as inspiring the European
Centre for Medium-Range Weather Forecasts (ECMWF) model.
</p>

<ul class="org-ul">
<li>Y. Mintz,<br>
"Design of Some Numerical General Circulation Experiments".<br>
<i>Bulletin of the Research Council of Israel</i> <b>76</b> (1958) 67&#x2013;114.</li>
<li>W.E. Langlois and H.C.W. Kwok,<br>
"Description of the Mintz-Arakawa Numerical General Circulation Model".<br>
(Dept. of Meteorology, University of California at Los Angeles, 1969).</li>
<li>A. Arakawa,<br>
"Numerical Simulation of Large-Scale Atmospheric Motions".<br>
<i>Numerical Solution of Field Problems in Continuum Physics</i>
(SIAM-AMS Proceedings, American Mathematical Society) <b>2</b> (1970) 24&#x2013;40.</li>
</ul>
</div>
</div>
