physics/climate/models-hierarchy.org
**** Model II (1965--1972??)
:PROPERTIES:
:CUSTOM_ID: h-02d3e4e2-f2b0-4c57-9a5d-156a4adc293f
:END:

This extended the first model with more vertical layers. A 3-layer and
9-layer version were made.

This model inspired RAND's model pretty directly.

Edwards describes this system's characteristics:

#+begin_quote
When Arakawa returned to UCLA from Japan in 1965, he and Mintz began
work on the first-generation "production" UCLA GCM. It increased model
resolution to 4° latitude x 5° longitude, although it still had only two
vertical levels, and introduced a new horizontal grid structure (the
Arakawa/Lamb "B" grid).[5] This was an extremely influential GCM. About
1970 Lawrence Gates, a UCLA graduate, carried the model with him to the
RAND Corporation, where he used it in a series of studies sponsored by
the Advanced Research Projects Agency of the U.S. Defense Dept. The RAND
version of the model was eventually carried to Oregon State
University.[6]
#+end_quote

The citations Edwards gives are:

- A. Arakawa and V.R. Lamb,\\
  "Computational Design of the Basic Dynamical Processes of the UCLA General Circulation Model".\\
  In {{{book-title(General Circulation Models of the Atmosphere)}}}, ed. J. Chang,
  Methods in Computational Physics: Advances in Research and Applications
  (San Francisco: Academic Press, 1977), 173--265.
- D. Randall,\\
  "Colorado State University General Circulation Model: Introduction".\\
  (n.d.) available from http://kiwi.atmos.colostate.edu/BUGS/BUGSintro.html.

**** Model III (1972??--mid 1970s)
:PROPERTIES:
:CUSTOM_ID: h-51e23b0c-ac21-4ea2-966c-20e65107f585
:END:

This incorporated Arakawa/Lamb "C" finite-difference horizontal grid.
In a nutshell: the velocity vectors are evaluated at the grid-edges.
It was a 12-level model. Two variants were built in the mid-1970s.

- A.Arakawa, V.R. Lamb,\\
  "Computational design of the basic dynamical processes of the UCLA general circulation model".\\
  /Methods in Computational Physics: Advances in Research and Applications/ *17* (1977) pp.173--265. doi:10.1016/B978-0-12-460817-7.50009-4. ISBN 9780124608177.

**** Model IV (late 1970s)
:PROPERTIES:
:CUSTOM_ID: h-2238ffc9-cdc5-49e2-9633-2a8ca2b2cd2a
:END:

This model employed a new vertical coordinate system which used the
planetary boundary layer as a coordinate surface, and extended vertical
resolution to 15 layers.

**** Model V (c.1990-????)
:PROPERTIES:
:CUSTOM_ID: h-c9ea2a8e-de5c-46c9-bc11-af09d963719a
:END:

A heavily modified version of UCLA III with up to 29 vertical levels.

*** The Livermore Atmospheric Model "LAM" (1960--1965)
:PROPERTIES:
:CUSTOM_ID: h-32736c4d-9f84-4ca5-9d8f-2a9738b2da11
:END:

Cecil Leith began working on a GCM while at Lawrence Livermore National
Laboratories. Due to the nature of Lawrence Livermore (working on
classified research most of the time), Leith's only unclassified
publication occurred when he was ending his work on the model.

But Leith's contributions are non-negligible: he would talk at
conferences about the innovative visualizations techniques, which other
models began copying.

Edwards describes the [[https://pne.people.si.umich.edu/vastmachine/llnl-lam.html][model's characteristics]] as:

#+begin_quote
The initial model was based on the Bjerknes/Richardson primitive
equations. It had five vertical levels and used a 5° x 5° horizontal
grid. It covered only the northern hemisphere, with a "slippery wall" at
60°N. In order to damp the effects of small-scale atmospheric waves,
Leith introduced an artificially high viscosity, which caused serious
problems and stimulated Leith's career-long interest in turbulence
problems.
#+end_quote

Although this model began around 1960, the first unclassified
publication appears in 1965, when Leith abandoned the project. But
Leith's influence was felt in talks and presentations at conferences,
where his visualization techniques were adopted by the field.

- C.E. Leith,\\
  "Numerical Simulation of the Earth's Atmosphere".
  In {{{book-title(Methods in Computational Physics)}}},
  eds. B. Alder, S. Fernbach, and M. Rotenberg
  (New York: Academic Press, 1965), 1--28.
- [[https://pne.people.si.umich.edu/vastmachine/llnl-lam.html][Characteristics]]


*** The National Center for Atmospheric Research (1964--????)

There are two families of models NCAR produced. One used finite
difference schemes (generically referred to as NCAR family of models),
the other used spectral schemes (the Community Climate Model Series, CCM).

**** NCAR 1 (1964--1967?)

A simple 2-layer atmosphere global model with 5-degree horizontal
resolution. Although they began working on the model in 1964, the first
publication on it appeared in 1967.

- A. Kasahara and W.M. Washington,\\
  "NCAR Global General Circulation Model of the Atmosphere".\\
  /Monthly Weather Review/ *95*, no.7 (1967) pp.389--402.

**** NCAR 2 (1967?--1970)

he basic model had a 5° horizontal, 6-layer resolution, but it could
also be run at resolutions as fine as 0.625° horizontal over a limited
domain, with up to 24 vertical layers.

- J.E. Oliger /et al/.,\\
  "Description of NCAR Global Circulation Model".
  National Center for Atmospheric Research, 1970
- A. Kasahara and W. M. Washington,\\
  "General Circulation Experiments with a Six-Layer NCAR Model, Including Orography, Cloudiness and Surface Temperature Calculations".\\
  /Journal of the Atmospheric Sciences/ *28*, no. 5 (1971) pp.657--701;
- A. Kasahara /et al/.,\\
  "Simulation Experiments with a 12-Layer Stratospheric Global Circulation Model. I. Dynamical Effect of the Earth's Orography and Thermal  Influence of Continentality".\\
  /Journal of Atmospheric Sciences/ *30*, no.7 (1973) pp.1229--51.

**** NCAR 3 (1970?--1973)

NCAR 3, finished about 1973, also allowed multiple resolutions,
including a user-specifiable vertical increment. The most significant
changes, however, involved improved finite-difference schemes.
 
- W.M. Washington /et al/.,\\
  "Preliminary Atmospheric Simulation with the Third-Generation NCAR General Circulation Model: January and July".\\
  In /Report of the JOC Conference on Climate Models: Performance, Intercomparison, and Sensitivity Studies/,
  (ed. W. Lawrence), WMO/ICSU Joint Organizing Committee and Global Atmospheric Research Programme, 1979. 


