docs/physics/climate/models-hierarchy.html

<div id="outline-container-h-02d3e4e2-f2b0-4c57-9a5d-156a4adc293f" class="outline-5">
<h5 id="h-02d3e4e2-f2b0-4c57-9a5d-156a4adc293f"><span class="section-number-5">2.1.2.2</span> Model II (1965&#x2013;1972??)</h5>
<div class="outline-text-5" id="text-h-02d3e4e2-f2b0-4c57-9a5d-156a4adc293f">
<p>
This extended the first model with more vertical layers. A 3-layer and
9-layer version were made.
</p>

<p>
This model inspired RAND's model pretty directly.
</p>

<p>
Edwards describes this system's characteristics:
</p>

<blockquote>
<p>
When Arakawa returned to UCLA from Japan in 1965, he and Mintz began
work on the first-generation "production" UCLA GCM. It increased model
resolution to 4° latitude x 5° longitude, although it still had only two
vertical levels, and introduced a new horizontal grid structure (the
Arakawa/Lamb "B" grid).[5] This was an extremely influential GCM. About
1970 Lawrence Gates, a UCLA graduate, carried the model with him to the
RAND Corporation, where he used it in a series of studies sponsored by
the Advanced Research Projects Agency of the U.S. Defense Dept. The RAND
version of the model was eventually carried to Oregon State
University.[6]
</p>
</blockquote>

<p>
The citations Edwards gives are:
</p>

<ul class="org-ul">
<li>A. Arakawa and V.R. Lamb,<br>
"Computational Design of the Basic Dynamical Processes of the UCLA General Circulation Model".<br>
In <cite class="book-title">General Circulation Models of the Atmosphere</cite>, ed. J. Chang,
Methods in Computational Physics: Advances in Research and Applications
(San Francisco: Academic Press, 1977), 173&#x2013;265.</li>
<li>D. Randall,<br>
"Colorado State University General Circulation Model: Introduction".<br>
(n.d.) available from <a href="http://kiwi.atmos.colostate.edu/BUGS/BUGSintro.html">http://kiwi.atmos.colostate.edu/BUGS/BUGSintro.html</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-h-51e23b0c-ac21-4ea2-966c-20e65107f585" class="outline-5">
<h5 id="h-51e23b0c-ac21-4ea2-966c-20e65107f585"><span class="section-number-5">2.1.2.3</span> Model III (1972??&#x2013;mid 1970s)</h5>
<div class="outline-text-5" id="text-h-51e23b0c-ac21-4ea2-966c-20e65107f585">
<p>
This incorporated Arakawa/Lamb "C" finite-difference horizontal grid.
In a nutshell: the velocity vectors are evaluated at the grid-edges.
It was a 12-level model. Two variants were built in the mid-1970s.
</p>

<ul class="org-ul">
<li>A.Arakawa, V.R. Lamb,<br>
"Computational design of the basic dynamical processes of the UCLA general circulation model".<br>
<i>Methods in Computational Physics: Advances in Research and Applications</i> <b>17</b> (1977) pp.173&#x2013;265. <a href="10.1016/B978-0-12-460817-7.50009-4">10.1016/B978-0-12-460817-7.50009-4</a>. ISBN 9780124608177.</li>
</ul>
</div>
</div>

<div id="outline-container-h-2238ffc9-cdc5-49e2-9633-2a8ca2b2cd2a" class="outline-5">
<h5 id="h-2238ffc9-cdc5-49e2-9633-2a8ca2b2cd2a"><span class="section-number-5">2.1.2.4</span> Model IV (late 1970s)</h5>
<div class="outline-text-5" id="text-h-2238ffc9-cdc5-49e2-9633-2a8ca2b2cd2a">
<p>
This model employed a new vertical coordinate system which used the
planetary boundary layer as a coordinate surface, and extended vertical
resolution to 15 layers.
</p>
</div>
</div>

<div id="outline-container-h-c9ea2a8e-de5c-46c9-bc11-af09d963719a" class="outline-5">
<h5 id="h-c9ea2a8e-de5c-46c9-bc11-af09d963719a"><span class="section-number-5">2.1.2.5</span> Model V (c.1990-????)</h5>
<div class="outline-text-5" id="text-h-c9ea2a8e-de5c-46c9-bc11-af09d963719a">
<p>
A heavily modified version of UCLA III with up to 29 vertical levels.
</p>
</div>
</div>
</div>

<div id="outline-container-h-32736c4d-9f84-4ca5-9d8f-2a9738b2da11" class="outline-4">
<h4 id="h-32736c4d-9f84-4ca5-9d8f-2a9738b2da11"><span class="section-number-4">2.1.3</span> The Livermore Atmospheric Model "LAM" (1960&#x2013;1965)</h4>
<div class="outline-text-4" id="text-h-32736c4d-9f84-4ca5-9d8f-2a9738b2da11">
<p>
Cecil Leith began working on a GCM while at Lawrence Livermore National
Laboratories. Due to the nature of Lawrence Livermore (working on
classified research most of the time), Leith's only unclassified
publication occurred when he was ending his work on the model.
</p>

<p>
But Leith's contributions are non-negligible: he would talk at
conferences about the innovative visualizations techniques, which other
models began copying.
</p>

<p>
Edwards describes the <a href="https://pne.people.si.umich.edu/vastmachine/llnl-lam.html">model's characteristics</a> as:
</p>

<blockquote>
<p>
The initial model was based on the Bjerknes/Richardson primitive
equations. It had five vertical levels and used a 5° x 5° horizontal
grid. It covered only the northern hemisphere, with a "slippery wall" at
60°N. In order to damp the effects of small-scale atmospheric waves,
Leith introduced an artificially high viscosity, which caused serious
problems and stimulated Leith's career-long interest in turbulence
problems.
</p>
</blockquote>

<p>
Although this model began around 1960, the first unclassified
publication appears in 1965, when Leith abandoned the project. But
Leith's influence was felt in talks and presentations at conferences,
where his visualization techniques were adopted by the field.
</p>

<ul class="org-ul">
<li>C.E. Leith,<br>
"Numerical Simulation of the Earth's Atmosphere".
In <cite class="book-title">Methods in Computational Physics</cite>,
eds. B. Alder, S. Fernbach, and M. Rotenberg
(New York: Academic Press, 1965), 1&#x2013;28.</li>
<li><a href="https://pne.people.si.umich.edu/vastmachine/llnl-lam.html">Characteristics</a></li>
</ul>
</div>
</div>


<div id="outline-container-h-d66b6597-34d0-4658-9ca0-cc2ed6ae6d1b" class="outline-4">
<h4 id="h-d66b6597-34d0-4658-9ca0-cc2ed6ae6d1b"><span class="section-number-4">2.1.4</span> The National Center for Atmospheric Research (1964&#x2013;????)</h4>
<div class="outline-text-4" id="text-h-d66b6597-34d0-4658-9ca0-cc2ed6ae6d1b">
<p>
There are two families of models NCAR produced. One used finite
difference schemes (generically referred to as NCAR family of models),
the other used spectral schemes (the Community Climate Model Series, CCM).
</p>
</div>

<div id="outline-container-h-9714e84d-954b-4f73-b6de-8d4b8768da73" class="outline-5">
<h5 id="h-9714e84d-954b-4f73-b6de-8d4b8768da73"><span class="section-number-5">2.1.4.1</span> NCAR 1 (1964&#x2013;1967?)</h5>
<div class="outline-text-5" id="text-h-9714e84d-954b-4f73-b6de-8d4b8768da73">
<p>
A simple 2-layer atmosphere global model with 5-degree horizontal
resolution. Although they began working on the model in 1964, the first
publication on it appeared in 1967.
</p>

<ul class="org-ul">
<li>A. Kasahara and W.M. Washington,<br>
"NCAR Global General Circulation Model of the Atmosphere".<br>
<i>Monthly Weather Review</i> <b>95</b>, no.7 (1967) pp.389&#x2013;402.</li>
</ul>
</div>
</div>

<div id="outline-container-h-34006cdd-68e4-4324-95b4-654a1162c2c6" class="outline-5">
<h5 id="h-34006cdd-68e4-4324-95b4-654a1162c2c6"><span class="section-number-5">2.1.4.2</span> NCAR 2 (1967?&#x2013;1970)</h5>
<div class="outline-text-5" id="text-h-34006cdd-68e4-4324-95b4-654a1162c2c6">
<p>
he basic model had a 5° horizontal, 6-layer resolution, but it could
also be run at resolutions as fine as 0.625° horizontal over a limited
domain, with up to 24 vertical layers.
</p>

<ul class="org-ul">
<li>J.E. Oliger <i>et al</i>.,<br>
"Description of NCAR Global Circulation Model".
National Center for Atmospheric Research, 1970</li>
<li>A. Kasahara and W. M. Washington,<br>
"General Circulation Experiments with a Six-Layer NCAR Model, Including Orography, Cloudiness and Surface Temperature Calculations".<br>
<i>Journal of the Atmospheric Sciences</i> <b>28</b>, no. 5 (1971) pp.657&#x2013;701;</li>
<li>A. Kasahara <i>et al</i>.,<br>
"Simulation Experiments with a 12-Layer Stratospheric Global Circulation Model. I. Dynamical Effect of the Earth's Orography and Thermal  Influence of Continentality".<br>
<i>Journal of Atmospheric Sciences</i> <b>30</b>, no.7 (1973) pp.1229&#x2013;51.</li>
</ul>
</div>
</div>

<div id="outline-container-h-bbd4824e-994d-4e3d-b72d-55010bfd3908" class="outline-5">
<h5 id="h-bbd4824e-994d-4e3d-b72d-55010bfd3908"><span class="section-number-5">2.1.4.3</span> NCAR 3 (1970?&#x2013;1973)</h5>
<div class="outline-text-5" id="text-h-bbd4824e-994d-4e3d-b72d-55010bfd3908">
<p>
NCAR 3, finished about 1973, also allowed multiple resolutions,
including a user-specifiable vertical increment. The most significant
changes, however, involved improved finite-difference schemes.
</p>

<ul class="org-ul">
<li>W.M. Washington <i>et al</i>.,<br>
"Preliminary Atmospheric Simulation with the Third-Generation NCAR General Circulation Model: January and July".<br>
In <i>Report of the JOC Conference on Climate Models: Performance, Intercomparison, and Sensitivity Studies</i>,
(ed. W. Lawrence), WMO/ICSU Joint Organizing Committee and Global Atmospheric Research Programme, 1979.</li>
</ul>
</div>
</div>
