physics/climate/models-hierarchy.org
**** CCM-0A (197?--1977?)

The initial version of the Community Climate Model was based on the
spectral model of the Australian Numerical Meteorological Research
Centre. One member of the ANMRC team (K. Puri) brought the model to NCAR
during an extended visit. Later, it was extensively revised.

- W. Bourke /et al/.,\\
  "Global Modeling of Atmospheric Flow by Spectral Methods".\\
  In /General Circulation Models of the Atmosphere/,
  Methods in Computational Physics: Advances in Research and Applications
  (San Francisco: Academic Press, 1977), pp.267--324.

**** CCM-0B (1981--198?)

Initial code for CCM-0B came from an early version of the European
Center for Medium Range Weather Forecasts model. Physical
parameterizations, including the radiation and cloud routines of
Ramanathan, and numerical approximations were added from CCM-0A.
Energy balance and flux prescriptions from the early GFDL models were
incorporated, while the finite difference scheme was derived from the
Australian spectral model that was the basis for CCM-0A.

- V. Ramanathan /et al/.,\\
  "The Response of a Spectral General Circulation Model to Refinements in Radiative Processes".\\
  /Journal of Atmospheric Sciences/ *40* (1983) pp.605--630.

**** CCM-1 (1987?--????)

CCM-1 evolved from CCM-0B in the mid-1980s. The primary differences were
changed parameterizations, new horizontal and vertical diffusion
schemes, and changes to moisture adjustment and condensation schemes.


- D.L. Williamson /et al/.,\\
  "Description of NCAR Community Climate Model (CCM1)".
  (National Center for Atmospheric Reasearch, 1987).


** Australian  Numerical  Meteorological  Research  Centre [ANMRC] (1977)
:PROPERTIES:
:CUSTOM_ID: h-1a943d30-650d-4ad9-819b-620b7af5f6ea
:END:

Innovative use of spectral methods, which inspired NCAR's CCM-0A model.

- Bourke, W.P., B. McAvaney, K. Puri, and R. Thurling, 1977:\\
  "Global modelling of atmospheric flow by spectral methods".\\
  In {{{book-title(Methods in Computational Physics)}}}, 17, J. Chang (ed.), Academic Press, New York,
  267--324.
- McAvaney, B.J., W. Bourke, and K. Puri,\\
  "A global spectral model for simulation of the general circulation".\\
  /J. Atmos. Sci./ *35* (1978) 1557--1583.
