docs/physics/climate/models-hierarchy.html


<div id="outline-container-h-a044a191-3e6e-4d38-9a0c-e64668da8917" class="outline-5">
<h5 id="h-a044a191-3e6e-4d38-9a0c-e64668da8917"><span class="section-number-5">2.1.4.4</span> CCM-0A (197?&#x2013;1977?)</h5>
<div class="outline-text-5" id="text-h-a044a191-3e6e-4d38-9a0c-e64668da8917">
<p>
The initial version of the Community Climate Model was based on the
spectral model of the Australian Numerical Meteorological Research
Centre. One member of the ANMRC team (K. Puri) brought the model to NCAR
during an extended visit. Later, it was extensively revised.
</p>

<ul class="org-ul">
<li>W. Bourke <i>et al</i>.,<br>
"Global Modeling of Atmospheric Flow by Spectral Methods".<br>
In <i>General Circulation Models of the Atmosphere</i>,
Methods in Computational Physics: Advances in Research and Applications
(San Francisco: Academic Press, 1977), pp.267&#x2013;324.</li>
</ul>
</div>
</div>

<div id="outline-container-h-8d9835ea-f58f-4e38-a823-c726ee917d97" class="outline-5">
<h5 id="h-8d9835ea-f58f-4e38-a823-c726ee917d97"><span class="section-number-5">2.1.4.5</span> CCM-0B (1981&#x2013;198?)</h5>
<div class="outline-text-5" id="text-h-8d9835ea-f58f-4e38-a823-c726ee917d97">
<p>
Initial code for CCM-0B came from an early version of the European
Center for Medium Range Weather Forecasts model. Physical
parameterizations, including the radiation and cloud routines of
Ramanathan, and numerical approximations were added from CCM-0A.
Energy balance and flux prescriptions from the early GFDL models were
incorporated, while the finite difference scheme was derived from the
Australian spectral model that was the basis for CCM-0A.
</p>

<ul class="org-ul">
<li>V. Ramanathan <i>et al</i>.,<br>
"The Response of a Spectral General Circulation Model to Refinements in Radiative Processes".<br>
<i>Journal of Atmospheric Sciences</i> <b>40</b> (1983) pp.605&#x2013;630.</li>
</ul>
</div>
</div>

<div id="outline-container-h-4fdb5799-e3c1-4555-892e-466aed11ef1d" class="outline-5">
<h5 id="h-4fdb5799-e3c1-4555-892e-466aed11ef1d"><span class="section-number-5">2.1.4.6</span> CCM-1 (1987?&#x2013;????)</h5>
<div class="outline-text-5" id="text-h-4fdb5799-e3c1-4555-892e-466aed11ef1d">
<p>
CCM-1 evolved from CCM-0B in the mid-1980s. The primary differences were
changed parameterizations, new horizontal and vertical diffusion
schemes, and changes to moisture adjustment and condensation schemes.
</p>


<ul class="org-ul">
<li>D.L. Williamson <i>et al</i>.,<br>
"Description of NCAR Community Climate Model (CCM1)".
(National Center for Atmospheric Reasearch, 1987).</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-h-1a943d30-650d-4ad9-819b-620b7af5f6ea" class="outline-3">
<h3 id="h-1a943d30-650d-4ad9-819b-620b7af5f6ea"><span class="section-number-3">2.2</span> Australian  Numerical  Meteorological  Research  Centre [ANMRC] (1977)</h3>
<div class="outline-text-3" id="text-h-1a943d30-650d-4ad9-819b-620b7af5f6ea">
<p>
Innovative use of spectral methods, which inspired NCAR's CCM-0A model.
</p>

<ul class="org-ul">
<li>Bourke, W.P., B. McAvaney, K. Puri, and R. Thurling, 1977:<br>
"Global modelling of atmospheric flow by spectral methods".<br>
In <cite class="book-title">Methods in Computational Physics</cite>, 17, J. Chang (ed.), Academic Press, New York,
267&#x2013;324.</li>
<li>McAvaney, B.J., W. Bourke, and K. Puri,<br>
"A global spectral model for simulation of the general circulation".<br>
<i>J. Atmos. Sci.</i> <b>35</b> (1978) 1557&#x2013;1583.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-06-01 Tue 19:12.</p>
</div>
</body>
</html>